app/controllers/web/api/auth_controller.rb

INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "phone", "status", "email_verified_at", "last_login_at", "metadata", "created_at", "updated_at", "provider", "uid", "username") VALUES ('jiralo8110@aixind.com', '$2a$12$GRvFBSeXJcr7jQDL3aCONOVo9A2y9gmFulRS.GXsS6naNynAjYCZO', 'Ian', 'Mwangi', NULL, 'pending', NULL, NULL, NULL, '2026-02-05 19:30:13.256535', '2026-02-05 19:30:13.256535', NULL, NULL, 'jiraya') RETURNING "id"
---
      def register
        user = User.new(register_params)
        user.status = 'pending'

        if user.save

UPDATE "users" SET "last_login_at" = '2026-02-05 13:55:01.135924', "updated_at" = '2026-02-05 13:55:01.144136' WHERE "users"."id" = 1
---
      def verify_email
        token = params[:token]
        user = User.find_by_token_for(:email_verification, token)

        if user
          user.update!(status: 'active', email_verified_at: Time.current)

SELECT "users".* FROM "users" WHERE "users"."email" = 'ndegwaian001@gmail.com' LIMIT 1
UPDATE "users" SET "last_login_at" = '2026-02-05 21:00:18.383878', "updated_at" = '2026-02-05 21:00:18.390982' WHERE "users"."id" = 3
---
      def login
        user = User.find_by(email: login_params[:email])

        if user&.authenticate(login_params[:password])
          user.update(last_login_at: Time.current)