app/controllers/concerns/jwt_authenticated.rb

  def authenticate_request
    header = request.headers['Authorization']
    token = header&.split(' ')&.last

    return render_unauthorized('Missing authorization header') unless token

    begin
      @decoded_token = jwt_decode(token)

      if @decoded_token[:reseller_id] && @decoded_token[:jti]
        authenticate_reseller_with_rotation
      elsif @decoded_token[:reseller_id]
        @current_reseller = Reseller.find(@decoded_token[:reseller_id])
      elsif @decoded_token[:user_id]
        @current_user = User.find(@decoded_token[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1